###################################################################

# Created by write_sdc on Tue Feb 28 22:19:43 2017

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode top
set_wire_load_model -name Small -library                                       \
sc12mc_logic0040ll_base_lvt_c40_ss_typical_max_0p99v_125c
create_clock -name clk  -period 5  -waveform {0 2.5}
set_input_delay -clock clk  0  [get_ports {y_1[0][12]}]
set_input_delay -clock clk  0  [get_ports {y_1[0][11]}]
set_input_delay -clock clk  0  [get_ports {y_1[0][10]}]
set_input_delay -clock clk  0  [get_ports {y_1[0][9]}]
set_input_delay -clock clk  0  [get_ports {y_1[0][8]}]
set_input_delay -clock clk  0  [get_ports {y_1[0][7]}]
set_input_delay -clock clk  0  [get_ports {y_1[0][6]}]
set_input_delay -clock clk  0  [get_ports {y_1[0][5]}]
set_input_delay -clock clk  0  [get_ports {y_1[0][4]}]
set_input_delay -clock clk  0  [get_ports {y_1[0][3]}]
set_input_delay -clock clk  0  [get_ports {y_1[0][2]}]
set_input_delay -clock clk  0  [get_ports {y_1[0][1]}]
set_input_delay -clock clk  0  [get_ports {y_1[0][0]}]
set_input_delay -clock clk  0  [get_ports {y_1[1][12]}]
set_input_delay -clock clk  0  [get_ports {y_1[1][11]}]
set_input_delay -clock clk  0  [get_ports {y_1[1][10]}]
set_input_delay -clock clk  0  [get_ports {y_1[1][9]}]
set_input_delay -clock clk  0  [get_ports {y_1[1][8]}]
set_input_delay -clock clk  0  [get_ports {y_1[1][7]}]
set_input_delay -clock clk  0  [get_ports {y_1[1][6]}]
set_input_delay -clock clk  0  [get_ports {y_1[1][5]}]
set_input_delay -clock clk  0  [get_ports {y_1[1][4]}]
set_input_delay -clock clk  0  [get_ports {y_1[1][3]}]
set_input_delay -clock clk  0  [get_ports {y_1[1][2]}]
set_input_delay -clock clk  0  [get_ports {y_1[1][1]}]
set_input_delay -clock clk  0  [get_ports {y_1[1][0]}]
set_input_delay -clock clk  0  [get_ports {y_1[2][12]}]
set_input_delay -clock clk  0  [get_ports {y_1[2][11]}]
set_input_delay -clock clk  0  [get_ports {y_1[2][10]}]
set_input_delay -clock clk  0  [get_ports {y_1[2][9]}]
set_input_delay -clock clk  0  [get_ports {y_1[2][8]}]
set_input_delay -clock clk  0  [get_ports {y_1[2][7]}]
set_input_delay -clock clk  0  [get_ports {y_1[2][6]}]
set_input_delay -clock clk  0  [get_ports {y_1[2][5]}]
set_input_delay -clock clk  0  [get_ports {y_1[2][4]}]
set_input_delay -clock clk  0  [get_ports {y_1[2][3]}]
set_input_delay -clock clk  0  [get_ports {y_1[2][2]}]
set_input_delay -clock clk  0  [get_ports {y_1[2][1]}]
set_input_delay -clock clk  0  [get_ports {y_1[2][0]}]
set_input_delay -clock clk  0  [get_ports {y_1[3][12]}]
set_input_delay -clock clk  0  [get_ports {y_1[3][11]}]
set_input_delay -clock clk  0  [get_ports {y_1[3][10]}]
set_input_delay -clock clk  0  [get_ports {y_1[3][9]}]
set_input_delay -clock clk  0  [get_ports {y_1[3][8]}]
set_input_delay -clock clk  0  [get_ports {y_1[3][7]}]
set_input_delay -clock clk  0  [get_ports {y_1[3][6]}]
set_input_delay -clock clk  0  [get_ports {y_1[3][5]}]
set_input_delay -clock clk  0  [get_ports {y_1[3][4]}]
set_input_delay -clock clk  0  [get_ports {y_1[3][3]}]
set_input_delay -clock clk  0  [get_ports {y_1[3][2]}]
set_input_delay -clock clk  0  [get_ports {y_1[3][1]}]
set_input_delay -clock clk  0  [get_ports {y_1[3][0]}]
set_input_delay -clock clk  0  [get_ports {y_1[4][12]}]
set_input_delay -clock clk  0  [get_ports {y_1[4][11]}]
set_input_delay -clock clk  0  [get_ports {y_1[4][10]}]
set_input_delay -clock clk  0  [get_ports {y_1[4][9]}]
set_input_delay -clock clk  0  [get_ports {y_1[4][8]}]
set_input_delay -clock clk  0  [get_ports {y_1[4][7]}]
set_input_delay -clock clk  0  [get_ports {y_1[4][6]}]
set_input_delay -clock clk  0  [get_ports {y_1[4][5]}]
set_input_delay -clock clk  0  [get_ports {y_1[4][4]}]
set_input_delay -clock clk  0  [get_ports {y_1[4][3]}]
set_input_delay -clock clk  0  [get_ports {y_1[4][2]}]
set_input_delay -clock clk  0  [get_ports {y_1[4][1]}]
set_input_delay -clock clk  0  [get_ports {y_1[4][0]}]
set_input_delay -clock clk  0  [get_ports {y_1[5][12]}]
set_input_delay -clock clk  0  [get_ports {y_1[5][11]}]
set_input_delay -clock clk  0  [get_ports {y_1[5][10]}]
set_input_delay -clock clk  0  [get_ports {y_1[5][9]}]
set_input_delay -clock clk  0  [get_ports {y_1[5][8]}]
set_input_delay -clock clk  0  [get_ports {y_1[5][7]}]
set_input_delay -clock clk  0  [get_ports {y_1[5][6]}]
set_input_delay -clock clk  0  [get_ports {y_1[5][5]}]
set_input_delay -clock clk  0  [get_ports {y_1[5][4]}]
set_input_delay -clock clk  0  [get_ports {y_1[5][3]}]
set_input_delay -clock clk  0  [get_ports {y_1[5][2]}]
set_input_delay -clock clk  0  [get_ports {y_1[5][1]}]
set_input_delay -clock clk  0  [get_ports {y_1[5][0]}]
set_input_delay -clock clk  0  [get_ports {y_1[6][12]}]
set_input_delay -clock clk  0  [get_ports {y_1[6][11]}]
set_input_delay -clock clk  0  [get_ports {y_1[6][10]}]
set_input_delay -clock clk  0  [get_ports {y_1[6][9]}]
set_input_delay -clock clk  0  [get_ports {y_1[6][8]}]
set_input_delay -clock clk  0  [get_ports {y_1[6][7]}]
set_input_delay -clock clk  0  [get_ports {y_1[6][6]}]
set_input_delay -clock clk  0  [get_ports {y_1[6][5]}]
set_input_delay -clock clk  0  [get_ports {y_1[6][4]}]
set_input_delay -clock clk  0  [get_ports {y_1[6][3]}]
set_input_delay -clock clk  0  [get_ports {y_1[6][2]}]
set_input_delay -clock clk  0  [get_ports {y_1[6][1]}]
set_input_delay -clock clk  0  [get_ports {y_1[6][0]}]
set_input_delay -clock clk  0  [get_ports {y_1[7][12]}]
set_input_delay -clock clk  0  [get_ports {y_1[7][11]}]
set_input_delay -clock clk  0  [get_ports {y_1[7][10]}]
set_input_delay -clock clk  0  [get_ports {y_1[7][9]}]
set_input_delay -clock clk  0  [get_ports {y_1[7][8]}]
set_input_delay -clock clk  0  [get_ports {y_1[7][7]}]
set_input_delay -clock clk  0  [get_ports {y_1[7][6]}]
set_input_delay -clock clk  0  [get_ports {y_1[7][5]}]
set_input_delay -clock clk  0  [get_ports {y_1[7][4]}]
set_input_delay -clock clk  0  [get_ports {y_1[7][3]}]
set_input_delay -clock clk  0  [get_ports {y_1[7][2]}]
set_input_delay -clock clk  0  [get_ports {y_1[7][1]}]
set_input_delay -clock clk  0  [get_ports {y_1[7][0]}]
set_input_delay -clock clk  0  [get_ports {y_2[0][12]}]
set_input_delay -clock clk  0  [get_ports {y_2[0][11]}]
set_input_delay -clock clk  0  [get_ports {y_2[0][10]}]
set_input_delay -clock clk  0  [get_ports {y_2[0][9]}]
set_input_delay -clock clk  0  [get_ports {y_2[0][8]}]
set_input_delay -clock clk  0  [get_ports {y_2[0][7]}]
set_input_delay -clock clk  0  [get_ports {y_2[0][6]}]
set_input_delay -clock clk  0  [get_ports {y_2[0][5]}]
set_input_delay -clock clk  0  [get_ports {y_2[0][4]}]
set_input_delay -clock clk  0  [get_ports {y_2[0][3]}]
set_input_delay -clock clk  0  [get_ports {y_2[0][2]}]
set_input_delay -clock clk  0  [get_ports {y_2[0][1]}]
set_input_delay -clock clk  0  [get_ports {y_2[0][0]}]
set_input_delay -clock clk  0  [get_ports {y_2[1][12]}]
set_input_delay -clock clk  0  [get_ports {y_2[1][11]}]
set_input_delay -clock clk  0  [get_ports {y_2[1][10]}]
set_input_delay -clock clk  0  [get_ports {y_2[1][9]}]
set_input_delay -clock clk  0  [get_ports {y_2[1][8]}]
set_input_delay -clock clk  0  [get_ports {y_2[1][7]}]
set_input_delay -clock clk  0  [get_ports {y_2[1][6]}]
set_input_delay -clock clk  0  [get_ports {y_2[1][5]}]
set_input_delay -clock clk  0  [get_ports {y_2[1][4]}]
set_input_delay -clock clk  0  [get_ports {y_2[1][3]}]
set_input_delay -clock clk  0  [get_ports {y_2[1][2]}]
set_input_delay -clock clk  0  [get_ports {y_2[1][1]}]
set_input_delay -clock clk  0  [get_ports {y_2[1][0]}]
set_input_delay -clock clk  0  [get_ports {y_2[2][12]}]
set_input_delay -clock clk  0  [get_ports {y_2[2][11]}]
set_input_delay -clock clk  0  [get_ports {y_2[2][10]}]
set_input_delay -clock clk  0  [get_ports {y_2[2][9]}]
set_input_delay -clock clk  0  [get_ports {y_2[2][8]}]
set_input_delay -clock clk  0  [get_ports {y_2[2][7]}]
set_input_delay -clock clk  0  [get_ports {y_2[2][6]}]
set_input_delay -clock clk  0  [get_ports {y_2[2][5]}]
set_input_delay -clock clk  0  [get_ports {y_2[2][4]}]
set_input_delay -clock clk  0  [get_ports {y_2[2][3]}]
set_input_delay -clock clk  0  [get_ports {y_2[2][2]}]
set_input_delay -clock clk  0  [get_ports {y_2[2][1]}]
set_input_delay -clock clk  0  [get_ports {y_2[2][0]}]
set_input_delay -clock clk  0  [get_ports {y_2[3][12]}]
set_input_delay -clock clk  0  [get_ports {y_2[3][11]}]
set_input_delay -clock clk  0  [get_ports {y_2[3][10]}]
set_input_delay -clock clk  0  [get_ports {y_2[3][9]}]
set_input_delay -clock clk  0  [get_ports {y_2[3][8]}]
set_input_delay -clock clk  0  [get_ports {y_2[3][7]}]
set_input_delay -clock clk  0  [get_ports {y_2[3][6]}]
set_input_delay -clock clk  0  [get_ports {y_2[3][5]}]
set_input_delay -clock clk  0  [get_ports {y_2[3][4]}]
set_input_delay -clock clk  0  [get_ports {y_2[3][3]}]
set_input_delay -clock clk  0  [get_ports {y_2[3][2]}]
set_input_delay -clock clk  0  [get_ports {y_2[3][1]}]
set_input_delay -clock clk  0  [get_ports {y_2[3][0]}]
set_input_delay -clock clk  0  [get_ports {y_2[4][12]}]
set_input_delay -clock clk  0  [get_ports {y_2[4][11]}]
set_input_delay -clock clk  0  [get_ports {y_2[4][10]}]
set_input_delay -clock clk  0  [get_ports {y_2[4][9]}]
set_input_delay -clock clk  0  [get_ports {y_2[4][8]}]
set_input_delay -clock clk  0  [get_ports {y_2[4][7]}]
set_input_delay -clock clk  0  [get_ports {y_2[4][6]}]
set_input_delay -clock clk  0  [get_ports {y_2[4][5]}]
set_input_delay -clock clk  0  [get_ports {y_2[4][4]}]
set_input_delay -clock clk  0  [get_ports {y_2[4][3]}]
set_input_delay -clock clk  0  [get_ports {y_2[4][2]}]
set_input_delay -clock clk  0  [get_ports {y_2[4][1]}]
set_input_delay -clock clk  0  [get_ports {y_2[4][0]}]
set_input_delay -clock clk  0  [get_ports {y_2[5][12]}]
set_input_delay -clock clk  0  [get_ports {y_2[5][11]}]
set_input_delay -clock clk  0  [get_ports {y_2[5][10]}]
set_input_delay -clock clk  0  [get_ports {y_2[5][9]}]
set_input_delay -clock clk  0  [get_ports {y_2[5][8]}]
set_input_delay -clock clk  0  [get_ports {y_2[5][7]}]
set_input_delay -clock clk  0  [get_ports {y_2[5][6]}]
set_input_delay -clock clk  0  [get_ports {y_2[5][5]}]
set_input_delay -clock clk  0  [get_ports {y_2[5][4]}]
set_input_delay -clock clk  0  [get_ports {y_2[5][3]}]
set_input_delay -clock clk  0  [get_ports {y_2[5][2]}]
set_input_delay -clock clk  0  [get_ports {y_2[5][1]}]
set_input_delay -clock clk  0  [get_ports {y_2[5][0]}]
set_input_delay -clock clk  0  [get_ports {y_2[6][12]}]
set_input_delay -clock clk  0  [get_ports {y_2[6][11]}]
set_input_delay -clock clk  0  [get_ports {y_2[6][10]}]
set_input_delay -clock clk  0  [get_ports {y_2[6][9]}]
set_input_delay -clock clk  0  [get_ports {y_2[6][8]}]
set_input_delay -clock clk  0  [get_ports {y_2[6][7]}]
set_input_delay -clock clk  0  [get_ports {y_2[6][6]}]
set_input_delay -clock clk  0  [get_ports {y_2[6][5]}]
set_input_delay -clock clk  0  [get_ports {y_2[6][4]}]
set_input_delay -clock clk  0  [get_ports {y_2[6][3]}]
set_input_delay -clock clk  0  [get_ports {y_2[6][2]}]
set_input_delay -clock clk  0  [get_ports {y_2[6][1]}]
set_input_delay -clock clk  0  [get_ports {y_2[6][0]}]
set_input_delay -clock clk  0  [get_ports {y_2[7][12]}]
set_input_delay -clock clk  0  [get_ports {y_2[7][11]}]
set_input_delay -clock clk  0  [get_ports {y_2[7][10]}]
set_input_delay -clock clk  0  [get_ports {y_2[7][9]}]
set_input_delay -clock clk  0  [get_ports {y_2[7][8]}]
set_input_delay -clock clk  0  [get_ports {y_2[7][7]}]
set_input_delay -clock clk  0  [get_ports {y_2[7][6]}]
set_input_delay -clock clk  0  [get_ports {y_2[7][5]}]
set_input_delay -clock clk  0  [get_ports {y_2[7][4]}]
set_input_delay -clock clk  0  [get_ports {y_2[7][3]}]
set_input_delay -clock clk  0  [get_ports {y_2[7][2]}]
set_input_delay -clock clk  0  [get_ports {y_2[7][1]}]
set_input_delay -clock clk  0  [get_ports {y_2[7][0]}]
set_output_delay -clock clk  0  [get_ports {sad[16]}]
set_output_delay -clock clk  0  [get_ports {sad[15]}]
set_output_delay -clock clk  0  [get_ports {sad[14]}]
set_output_delay -clock clk  0  [get_ports {sad[13]}]
set_output_delay -clock clk  0  [get_ports {sad[12]}]
set_output_delay -clock clk  0  [get_ports {sad[11]}]
set_output_delay -clock clk  0  [get_ports {sad[10]}]
set_output_delay -clock clk  0  [get_ports {sad[9]}]
set_output_delay -clock clk  0  [get_ports {sad[8]}]
set_output_delay -clock clk  0  [get_ports {sad[7]}]
set_output_delay -clock clk  0  [get_ports {sad[6]}]
set_output_delay -clock clk  0  [get_ports {sad[5]}]
set_output_delay -clock clk  0  [get_ports {sad[4]}]
set_output_delay -clock clk  0  [get_ports {sad[3]}]
set_output_delay -clock clk  0  [get_ports {sad[2]}]
set_output_delay -clock clk  0  [get_ports {sad[1]}]
set_output_delay -clock clk  0  [get_ports {sad[0]}]
